AccumulationRegisters/АР_РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/АР_РасчетыПоДоговорам/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СписокПерезаполнить.Видимость = (ПараметрыСеанса.ТекущийПользователь.Наименование = "Клес Александр");
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	ПерезаполнитьСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСервер()
	
	// Очистка регистра
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Рег.Период, Рег.Регистратор Из РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег Где Рег.Период >= ДатаВремя(2018,1,1) Упорядочить По Рег.Период";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Док = Рез.Регистратор.ПолучитьОбъект();
		
		Док.Движения.АР_РасчетыПоДоговорам.Прочитать();
		Док.Движения.АР_РасчетыПоДоговорам.Очистить();
		Док.Движения.АР_РасчетыПоДоговорам.Записать();
		
	КонецЦикла;
	
	ПоискПотерянныхДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПоискПотерянныхДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Док.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ Договоры
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК Док
	               |ГДЕ
	               |	Док.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Док.Ссылка КАК Регистратор
	               |ПОМЕСТИТЬ Регистраторы
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК Док
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	               |		ПО Док.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
	               |ГДЕ
	               |	Док.Проведен
	               |	И Док.Дата >= ДАТАВРЕМЯ(2018, 1, 1)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Док.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет КАК Док
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	               |		ПО Док.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
	               |ГДЕ
	               |	Док.Проведен
	               |	И Док.Дата >= ДАТАВРЕМЯ(2018, 1, 1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.Регистратор КАК РегистраторРег,
	               |	Регистраторы.Регистратор КАК РегистраторДок
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	               |		ПО Рег.Регистратор = Регистраторы.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт.РегистраторДок КАК РегистраторДок
	               |ИЗ
	               |	ВТ КАК Вт
	               |ГДЕ
	               |	Вт.РегистраторРег ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вт.РегистраторДок
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вт.РегистраторДок.Дата";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Док = Рез.РегистраторДок.ПолучитьОбъект();
		Док.Движения.Ар_РасчетыПоДоговорам.Прочитать();
		Док.Движения.Ар_РасчетыПоДоговорам.Очистить();
		Нов = Док.Движения.Ар_РасчетыПоДоговорам.Добавить();
		Нов.Период = Док.Дата;
		Нов.Сумма = Док.СуммаДокумента;
		Док.Движения.Ар_РасчетыПоДоговорам.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
